app/controllers/main_controller.rb

	def create
		title1 = params[:title]
		content1 = params[:content]
		begin
			content1 ["\n"] = "<br>"
		rescue

		end
		Post.create(title: title1, content: content1)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "rsd"], ["content", "yyi"], ["created_at", "2021-01-01 13:57:33.973349"], ["updated_at", "2021-01-01 13:57:33.973349"]]

	def update
		@post = Post.find(params[:id])
		title = params[:title]
		content = params[:content]
		begin
			content ["\n"] = "<br>"
		rescue

		end

		@post.title = params[:title]
		@post.content = params[:content]
		@post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "abcd"], ["content", "efg"], ["updated_at", "2021-01-01 12:19:35.182520"], ["id", 4]]

	def delete
		@post = Post.find(params[:id])
		@post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 17]]